import styles from './HofPage12.module.scss';
import textStyles from '../HofPage.module.scss';
import image from './images/image.png';

const HofPage12 = ({manrope}: any) => {
    return (
        <div className={styles.section}>
            <div className={styles.titleContainer}>
                <p className={textStyles.title}>
                    ПО ВЫСШЕМУ РАЗРЯДУ
                </p>
                <p className={styles.subtitle}>
                    ПОЗОЛОЧЕННЫЕ РАЗЪЕМЫ ПОДКЛЮЧЕНИЯ
                </p>
            </div>

            <ul className={styles.list}>
                <li className={styles.item}>
                    <svg className={styles.icon} width="177" height="69" viewBox="0 0 177 69" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M175.749 0.00486072C176.303 0.00218003 176.754 0.450679 176.754 1.00485V67.1369C176.754 67.6892 176.306 68.1369 175.754 68.1369H28.0766C27.8066 68.1369 27.548 68.0277 27.3597 67.8341L0.283105 39.9918C0.101567 39.8052 0 39.555 0 39.2946V1.85019C0 1.29979 0.444779 0.852864 0.995169 0.850201L175.749 0.00486072ZM8.59748 8.38224C8.04708 8.3849 7.60231 8.83183 7.60231 9.38222V36.231C7.60231 36.4914 7.70388 36.7415 7.88542 36.9281L30.5809 60.2654C30.7692 60.459 31.0278 60.5682 31.2978 60.5682H168.151C168.704 60.5682 169.151 60.1205 169.151 59.5682V8.61043C169.151 8.05626 168.701 7.60777 168.147 7.61045L8.59748 8.38224Z"
                              fill="#C7C3C3"/>
                        <rect x="41.8125" y="24.6113" width="100.731" height="10.8291" rx="4" fill="#C7C3C3"/>
                    </svg>

                    <p className={`${manrope.className} ${styles.itemText}`}>
                        DisplayPort
                    </p>
                </li>

                <li className={styles.item}>
                    <svg className={styles.icon} width="177" height="69" viewBox="0 0 177 69" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M175.749 0.430642C176.303 0.427961 176.754 0.87646 176.754 1.43063V67.5627C176.754 68.115 176.306 68.5627 175.754 68.5627H28.0766C27.8066 68.5627 27.548 68.4535 27.3597 68.2599L0.283105 40.4176C0.101567 40.2309 0 39.9808 0 39.7204V2.27597C0 1.72557 0.444779 1.27864 0.995169 1.27598L175.749 0.430642ZM8.59748 8.80802C8.04708 8.81068 7.60231 9.25761 7.60231 9.80801V36.6567C7.60231 36.9171 7.70388 37.1673 7.88542 37.3539L30.5809 60.6912C30.7692 60.8848 31.0278 60.994 31.2978 60.994H168.151C168.704 60.994 169.151 60.5463 169.151 59.994V9.03622C169.151 8.48204 168.701 8.03355 168.147 8.03623L8.59748 8.80802Z"
                              fill="#C7C3C3"/>
                        <rect x="41.8125" y="25.0371" width="100.731" height="10.8291" rx="4" fill="#C7C3C3"/>
                    </svg>

                    <p className={`${manrope.className} ${styles.itemText}`}>
                        DisplayPort
                    </p>
                </li>

                <li className={styles.item}>
                    <svg className={styles.icon} width="177" height="69" viewBox="0 0 177 69" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M175.749 0.426736C176.303 0.424055 176.754 0.872554 176.754 1.42673V67.5588C176.754 68.1111 176.306 68.5588 175.754 68.5588H28.0766C27.8066 68.5588 27.548 68.4496 27.3597 68.256L0.283105 40.4137C0.101567 40.227 0 39.9769 0 39.7165V2.27206C0 1.72167 0.444779 1.27474 0.995169 1.27208L175.749 0.426736ZM8.59748 8.80411C8.04708 8.80677 7.60231 9.2537 7.60231 9.8041V36.6528C7.60231 36.9132 7.70388 37.1633 7.88542 37.35L30.5809 60.6873C30.7692 60.8809 31.0278 60.9901 31.2978 60.9901H168.151C168.704 60.9901 169.151 60.5424 169.151 59.9901V9.03231C169.151 8.47813 168.701 8.02964 168.147 8.03232L8.59748 8.80411Z"
                              fill="#C7C3C3"/>
                        <rect x="41.8125" y="25.0332" width="100.731" height="10.8291" rx="4" fill="#C7C3C3"/>
                    </svg>

                    <p className={`${manrope.className} ${styles.itemText}`}>
                        DisplayPort
                    </p>
                </li>

                <li className={styles.item}>
                    <svg className={styles.icon} width="176" height="69" viewBox="0 0 176 69" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <rect x="35.875" y="24.8555" width="103.862" height="7.5202" rx="3.7601" fill="#C7C3C3"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M0 1.41406C0 0.861778 0.447716 0.414062 1 0.414062H174.621C175.173 0.414062 175.621 0.861777 175.621 1.41406V48.9374C175.621 49.4896 175.173 49.9374 174.621 49.9374H154.409C154.105 49.9374 153.817 50.0759 153.628 50.3138L139.744 67.7195C139.554 67.9574 139.266 68.0959 138.962 68.0959H36.6586C36.3543 68.0959 36.0665 67.9574 35.8768 67.7195L21.9931 50.3138C21.8034 50.0759 21.5156 49.9374 21.2114 49.9374H1C0.447715 49.9374 0 49.4896 0 48.9374V1.41406ZM8.24209 7.01717C7.68981 7.01717 7.24209 7.46488 7.24209 8.01717V42.3342C7.24209 42.8865 7.68981 43.3342 8.24209 43.3342H24.8992C25.2035 43.3342 25.4912 43.4728 25.681 43.7107L39.5646 61.1164C39.7544 61.3542 40.0421 61.4928 40.3464 61.4928H135.274C135.579 61.4928 135.866 61.3542 136.056 61.1164L149.94 43.7107C150.129 43.4728 150.417 43.3342 150.721 43.3342H167.379C167.931 43.3342 168.379 42.8865 168.379 42.3343V8.01717C168.379 7.46488 167.931 7.01717 167.379 7.01717H8.24209Z"
                              fill="#C7C3C3"/>
                    </svg>

                    <p className={`${manrope.className} ${styles.itemText}`}>
                        HDMI
                    </p>
                </li>
            </ul>

            <div className={styles.textContainer}>
                <p className={textStyles.text}>
                    УНИКАЛЬНЫЙ ДИЗАЙН ВЕНТИЛЯЦИОННОЙ РЕШёТКИ
                </p>
            </div>

            <img width={1862} height={1400} className={styles.image} alt='' src={'../images/hof-page/12/image.png'}/>
        </div>
    );
};

export default HofPage12;
