import cls from './Video.module.scss'
import styles from './HofAi.module.scss'

export const Video = () => {
    return (
        <>
            <div className={`${styles.box} ${cls.box1}`}>
                <ul className={cls.tagContainer}>
                    <li className={cls.tag}>
                        <p className={cls.tagText}>
                            .avi
                        </p>
                    </li>

                    <li className={cls.tag}>
                        <p className={cls.tagText}>
                            .mpg
                        </p>
                    </li>

                    <li className={cls.tag}>
                        <p className={cls.tagText}>
                            .gif
                        </p>
                    </li>
                </ul>

                <h3 className={styles.title}>Видео-режим</h3>
                <p className={styles.text}>
                    Поддерживает файлы в&nbsp;форматах .avi, .mpg и .gif.
                    К&nbsp;загрузке доступны файлы
                    с&nbsp;латинским названием (длина имени файла не&nbsp;должна превышать 18&nbsp;символов).
                </p>
            </div>

            <div className={`${styles.box} ${cls.box2}`}>
                <p className={styles.text}>
                    При загрузке файл будет конвертирован в&nbsp;формат .savi
                    с&nbsp;возможностью выбрать 1&nbsp;из&nbsp;3&nbsp;вариантов качества: высокое, среднее, низкое.
                </p>

                <svg className={cls.box2Vector} width="240" height="87" viewBox="0 0 240 87" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fillRule="evenodd" clipRule="evenodd"
                          d="M18.0485 83.4592C22.9621 85.5798 28.4753 86.6402 34.5882 86.6402C38.8827 86.6402 42.9838 86.1004 46.8914 85.0207C50.8377 83.9411 54.3391 82.3217 57.3955 80.1625C60.452 78.0033 62.8701 75.3042 64.6498 72.0654C66.4681 68.788 67.3773 64.9901 67.3773 60.6716C67.3773 56.5074 66.6036 53.0758 65.056 50.3767C63.5471 47.6777 61.6126 45.4992 59.2526 43.8412C56.8926 42.1832 54.4358 40.8916 51.8823 39.9662C49.3288 39.0408 47.0268 38.3082 44.9763 37.7684L30.0035 33.6042C28.1077 33.1029 26.2313 32.486 24.3742 31.7534C22.5558 30.9822 21.0276 29.9605 19.7896 28.6881C18.5515 27.3771 17.9325 25.6999 17.9325 23.6563C17.9325 21.4971 18.6482 19.6078 20.0797 17.9883C21.5499 16.3689 23.465 15.1351 25.8251 14.2868C28.2238 13.4 30.816 12.9758 33.6016 13.0144C36.4646 13.0915 39.1535 13.6699 41.6683 14.7495C44.2218 15.8291 46.3691 17.41 48.1101 19.4921C49.8898 21.5356 51.0892 24.0226 51.7082 26.953L66.739 24.3503C65.5009 19.2222 63.373 14.8459 60.3553 11.2215C57.3375 7.59706 53.5846 4.84019 49.0967 2.95086C44.6087 1.02298 39.5017 0.0397599 33.7757 0.00120503C28.1271 -0.0373544 22.9814 0.849472 18.3387 2.66168C13.7347 4.47389 10.0592 7.21148 7.31227 10.8745C4.60402 14.4989 3.2499 18.9908 3.2499 24.3503C3.2499 28.0133 3.84958 31.0979 5.04895 33.6042C6.287 36.0719 7.85392 38.1154 9.74969 39.7348C11.6842 41.3157 13.7153 42.5688 15.8433 43.4942C18.0099 44.381 20.0217 45.0943 21.8788 45.6341L43.4674 51.9962C45.015 52.4588 46.3691 53.0179 47.5298 53.6734C48.7291 54.2903 49.6964 54.9844 50.4315 55.7555C51.2052 56.5267 51.7856 57.4135 52.1725 58.416C52.5594 59.3799 52.7528 60.4403 52.7528 61.597C52.7528 64.1804 51.921 66.3589 50.2574 68.1325C48.6324 69.9062 46.5045 71.2557 43.8736 72.1811C41.2428 73.1064 38.4378 73.5691 35.4587 73.5691C30.4291 73.5691 25.9798 72.2196 22.1109 69.5206C18.2807 66.8215 15.7465 63.0043 14.5085 58.069L0 60.2668C0.851164 65.7034 2.84366 70.4074 5.97749 74.3788C9.15001 78.3117 13.1737 81.3385 18.0485 83.4592ZM74.1367 84.9055L100.484 1.62109H120.97L147.317 84.9055H132.925L127.151 66.8606H94.233L88.5291 84.9055H74.1367ZM110.592 15.1078L122.987 53.8474H98.3463L110.592 15.1078ZM142.105 1.62109L168.453 84.9055H188.939L215.286 1.62109H200.894L178.551 71.3718L156.498 1.62109H142.105ZM225.164 1.62109V84.9055H239.15V1.62109H225.164Z"
                          fill="#D8D8D8"/>
                </svg>
            </div>

            <div className={`${styles.box} ${cls.box3}`}>
                <div className={cls.box3Vector}/>
                <p className={styles.text}>
                    Время конвертации примерно равно длине загружаемого ролика, утилита HOF AI&nbsp;при этом работает
                    в&nbsp;фоновом режиме.
                    <br/><br/>
                    Рекомендуем использовать видео продолжительностью не&nbsp;более 10&nbsp;минут.
                </p>
            </div>
        </>
    );
};
